[
    {
        "id": 1,
        "url": "https://www.acmicpc.net/problem/13700",
        "title": "완전범죄",
        "description": "홍익대학교 근처에 있는 오락실에 새로운 게임이 들어왔다. 이 게임을 클리어하려면 방금 막 금은방을 턴 마포구 대도 X가 되어 아무에게도 들키지 않고 X의 집에 무사히 도착해야 한다. 게임은 오직 좌우 버튼 두 개로만 진행되고 규칙은 아래와 같다.\n마포구의 모든 건물은 일렬로 나열되어 있고 각 건물에는 1번부터 N번까지 번호가 지정되어 있다. 마포구에는 K개의 경찰서가 있고 경찰 내부에는 이미 X의 얼굴이 알려졌다.\n게임이 시작될 때 X는 막 범행을 끝내고 금은방 S 안에 있다.\nX는 자신의 집 D에 마포구를 떠날 수 있는 비밀 통로를 만들어놓았다. 따라서 경찰에게 발각되지 않고 무사히 집으로 돌아가야 한다.\n좌(←) 버튼을 누르면 후방으로 달리고, 우(→) 버튼을 누르면 전방으로 달린다. X는 마포구 내에서만 이동할 수 있으며, 자신이 오랜 연구 끝에 알아낸 이동 방식을 맹신하여 오직 그 방식으로만 이동한다.\nX의 달리기는 남에게 얼굴이 보이지 않을 정도로 매우 빠르다. 현재 X가 a번 건물 안에 있다고 가정하면, 밖으로 나와 전방으로 달려 a+F번 건물 안으로 이동하거나, 후방으로 달려 a-B번 건물 안으로 이동할 수 있다. 단, X의 달리기는 자신도 주체할 수 없을 만큼 빨라서 중간에 멈출 수 없다.\nX는 한 번 달리면 너무 힘들어 건물 안에서 10초 동안 휴식을 취해야 한다. 이때 X가 경찰서 안에서 휴식을 취할 경우, 그는 집에 돌아가지 못하고 체포된다.\n이 게임은 아직 베타 버전이라 무사히 집으로 가는 방법이 없는 버그도 존재한다.\n지언이의 취미는 오락실 게임을 누구보다 빠르게 클리어하는 것이다. 그래서 대도 X가 무사히 집에 도착할 수 있는 여러 방법 중에서도 좌우 버튼을 가장 최소로 눌렀을 때의 횟수를 알고 싶다.\n마포구 건물의 개수 N, 털린 금은방 S, 대도 X의 집 D, 앞으로 한 번에 달릴 수 있는 건물 수 F, 뒤로 한 번에 달릴 수 있는 건물 수 B, 마포구 경찰서의 개수 K, 각 경찰서의 건물 번호 l1, l2, …, lK가 주어질 때 대도 X가 무사히 집에 도착하기 위해 버튼을 눌러야 하는 최소 횟수를 출력하는 프로그램을 작성해라.\n만약 집으로 가는 방법이 없는 경우를 발견했다면 이 데이터를 게임 회사에 알리기 위해 “BUG FOUND”를 출력한다.",
        "input": "첫째 줄에 N, S, D, F, B, K가 주어지고, K > 0인 경우에는 둘째 줄에 경찰서의 위치 l1, l2, …, lK가 주어진다. (1 ≤ S, D ≤ N ≤ 100000, 0 ≤ F, B ≤ 100000, 0 ≤ K ≤ N/2, S ≠ D ≠ l) ",
        "output": "첫째 줄에 대도 X가 건물 S에서 자신의 집 D로 무사히 가기 위해 지언이가 버튼을 눌러야 하는 최소 횟수를 출력한다. 만약, D에 도달할 수 없는 데이터인 경우 “BUG FOUND”를 출력한다.",
        "time_limit": 1.0,
        "memory_limit": 1,
        "level" : 1,
        "created_by": "host_id",
        "created_at": "2024-05-14",
        "modified_at": "2024-05-14",
        "tags": [124, 102],
        "time_compexity": null
    },

    {
        "id": 2,
        "url": "https://www.acmicpc.net/problem/1188",
        "title": "음식 평론가",
        "description": "선영이의 직업은 소시지 요리사이다. 소시지를 팔기 전에 음식 평론가 M명을 모아서 맛을 테스트해보려고 한다.\n선영이는 동일한 소시지를 총 N개를 준비했다. 이 소시지를 모든 평론가들이 같은 양을 받게 소시지를 자르려고 한다. 이때, 소시지를 자르는 횟수를 최소로 하려고 한다.\n예를 들어, 소시지가 2개, 평론가가 6명있는 경우를 생각해보자. 이때, 각 소시지를 세 조각으로 만든 다음, 각 평론가에게 한 조각씩 주면 된다. 이 경우에 소시지는 총 네 번 자르게 된다. 다른 경우로 소시지가 3개, 평론가가 4명 있는 경우를 생각해보자. 이때는 각 소시지의 크기를 3:1로 잘라서 큰 조각을 평론가에게 하나씩 주고, 남은 조각을 평론가에게 주면 모두 동일한 양을 받게 된다.\n소시지의 수와 평론가의 수가 주어졌을 때, 모든 평론가에게 같은 양의 소시지를 주기 위해 필요한 칼질의 수를 구하는 프로그램을 작성하시오.",
        "input": "첫째 줄에 소시지의 수 N과 평론가의 수 M이 주어진다. (1 ≤ N, M ≤ 100)",
        "output": "첫째 줄에 모든 평론가에게 동일한 양을 주기 위해 필요한 칼질 횟수의 최솟값을 출력한다. ",
        "time_limit": 1.0,
        "memory_limit": 128,
        "level" : 2,
        "created_by": "host_id",
        "created_at": "2024-05-15",
        "modified_at": "2024-05-15",
        "tags": [124, 102],
        "time_compexity": null
    },

    {
        "id": 3,
        "url": "https://www.acmicpc.net/problem/1405",
        "title": "미친 로봇",
        "description": "통제 할 수 없는 미친 로봇이 평면위에 있다. 그리고 이 로봇은 N번의 행동을 취할 것이다.\n각 행동에서 로봇은 4개의 방향 중에 하나를 임의로 선택한다. 그리고 그 방향으로 한 칸 이동한다.\n로봇이 같은 곳을 한 번보다 많이 이동하지 않을 때, 로봇의 이동 경로가 단순하다고 한다. (로봇이 시작하는 위치가 처음 방문한 곳이다.) 로봇의 이동 경로가 단순할 확률을 구하는 프로그램을 작성하시오. 예를 들어, EENE와 ENW는 단순하지만, ENWS와 WWWWSNE는 단순하지 않다. (E는 동, W는 서, N은 북, S는 남)",
        "input": "첫째 줄에 N, 동쪽으로 이동할 확률, 서쪽으로 이동할 확률, 남쪽으로 이동할 확률, 북쪽으로 이동할 확률이 주어진다. N은 14보다 작거나 같은 자연수이고,  모든 확률은 100보다 작거나 같은 자연수 또는 0이다. 그리고, 동서남북으로 이동할 확률을 모두 더하면 100이다.\n확률의 단위는 %이다.",
        "output": "첫째 줄에 로봇의 이동 경로가 단순할 확률을 출력한다. 절대/상대 오차는 10-9 까지 허용한다.",
        "time_limit": 1.0,
        "memory_limit": 128,
        "level" : 3,
        "created_by": "host_id",
        "created_at": "2024-05-26",
        "modified_at": "2024-05-26",
        "tags": [124, 102],
        "time_compexity": null
    },

    {
        "id": 4,
        "url": "https://www.acmicpc.net/problem/3844",
        "title": "백발백준하는 명사수",
        "description": "백준 공화국 사람들은 매년 독립일을 기념한다. 그러나 독립이 아주 오래 전의 일이었으므로, 이젠 독립일을 정확하게 기억하는 사람은 아무도 없다. 사람들의 기억속에 남아있는 것은 독립일로부터 오늘까지의 날 수 (D) 가 완전제곱수라는 사실, 그리고 그 수가 n이하의 서로 다른 자연수의 곱으로 이루어졌고, 가능한 가장 큰 수라는 사실이다.\n백준 공화국은 1년이 1,000,000,007일 이므로 사람들은 D를 1,000,000,007로 나눈 나머지가 필요하다. 다만, D를 1,000,000,007로 나눈 나머지가 가장 큰 것이 아니라 D가 가장 큰 것을 원한다.",
        "input": "각 테스트케이스마다 한 줄 씩 n이 주어진다(1 ≤ n ≤ 10, 000, 000). 입력으로 0이 들어오면 종료한다.",
        "output": "각 테스트케이스마다 한 줄 씩 D를 1,000,000,007로 나눈 나머지를 출력한다.",
        "time_limit": 5.0,
        "memory_limit": 128,
        "level" : null,
        "created_by": "host_id",
        "created_at": "2024-05-26",
        "modified_at": "2024-05-26",
        "tags": [124, 102],
        "time_compexity": null
    },

    {
        "id": 5,
        "url": "https://www.acmicpc.net/problem/1480",
        "title": "보석 모으기",
        "description": "세준이는 잘 모르겠지만, 세준이는 보석에 미쳐있다. 따라서, 숌 보석상에 있는 모든 보석을 다 훔치려고 한다. 하지만, 세준이는 보석을 다 가져올 수는 없다. 그 이유는 가방의 개수에 제한이 있고, 한 가방마다 넣을 수 있는 보석의 개수가 제한이 있기 때문이다. 세준이는 M개의 가방을 가지고 있다. 그리고 각각의 가방은 C그램의 보석을 담을 수 있다.\n숌 보석상에는 보석이 N개 있다. N개의 보석의 무게가 주어졌을 때, 세준이가 훔칠 수 있는 보석의 최대 개수를 구하는 프로그램을 작성하시오.",
        "input": "첫째 줄에 보석의 개수 N, 가방의 개수 M, 가방의 최대 한도 C가 주어진다. N은 1보다 크거나 같고, 13보다 작거나 같은 자연수이고, M은 1보다 크거나 같고, 10보다 작거나 같은 자연수이다. C는 1보다 크고, 20보다 작거나 같은 자연수이다. 둘째 줄에 보석의 무게가 하나씩 주어진다. 보석의 무게는 1보다 크거나 같고, 20보다 작거나 같은 자연수이다.",
        "output": "첫째 줄에 세준이가 가져갈 수 있는 최대 보석의 개수를 출력한다.",
        "time_limit": 2.0,
        "memory_limit": 128,
        "level" : 2,
        "created_by": "host_id",
        "created_at": "2024-05-26",
        "modified_at": "2024-05-26",
        "tags": [124, 102],
        "time_compexity": null
    },

    {
        "id": 6,
        "url": "https://www.acmicpc.net/problem/9987",
        "title": "포켓몬 마스터",
        "description": "입력으로 포켓몬의 번호가 주어졌을 때, 그 포켓몬의 이름과 타입을 출력하는 프로그램을 작성하시오.",
        "input": "입력으로 포켓몬의 번호가 주어진다. 포켓몬의 번호는 718을 넘지 않는 자연수이다.",
        "output": "첫째 줄에 포켓몬의 이름을 출력한다. 둘째 줄에는 포켓몬의 타입을 공백으로 구분하여 출력한다.",
        "time_limit": 1.0,
        "memory_limit": 128,
        "level" : 1,
        "created_by": "host_id",
        "created_at": "2024-05-26",
        "modified_at": "2024-05-26",
        "tags": [124, 102],
        "time_compexity": null
    },

    {
        "id": 7,
        "url": "https://www.acmicpc.net/problem/1563",
        "title": "개근상",
        "description": "백준중학교에서는 학기가 끝날 무렵에 출결사항을 보고 개근상을 줄 것인지 말 것인지 결정한다. 이 학교는 이상해서 학생들이 학교를 너무 자주 빠지기 때문에, 개근상을 주는 조건이 조금 독특하다.\n출결사항이 기록되는 출결은 출석, 지각, 결석이다.\n개근상을 받을 수 없는 사람은 지각을 두 번 이상 했거나, 결석을 세 번 연속으로 한 사람이다.\n한 학기가 4일이고, O를 출석, L을 지각, A를 결석이라고 했을 때, 개근상을 받을 수 있는 출결정보는\nOOOO OOOA OOOL OOAO OOAA OOAL OOLO OOLA OAOO OAOA \nOAOL OAAO OAAL OALO OALA OLOO OLOA OLAO OLAA AOOO\nAOOA AOOL AOAO AOAA AOAL AOLO AOLA AAOO AAOA AAOL\nAALO AALA ALOO ALOA ALAO ALAA LOOO LOOA LOAO LOAA\nLAOO LAOA LAAO\n총 43가지이다.\n한 학기는 N일이다. N이 주어졌을 때, 개근상을 받을 수 있는 출결정보의 개수를 세는 프로그램을 작성하시오.",
        "input": "첫째 줄에 N이 주어진다. N은 1,000보다 작거나 같다.",
        "output": "첫째 줄에 정답을 1,000,000으로 나눈 나머지를 출력한다.",
        "time_limit": 2.0,
        "memory_limit": 128,
        "level" : 2,
        "created_by": "host_id",
        "created_at": "2024-05-28",
        "modified_at": "2024-05-28",
        "tags": [124, 102],
        "time_compexity": null
    },

    {
        "id": 8,
        "url": "https://www.acmicpc.net/problem/1184",
        "title": "귀농",
        "description": "상근이와 선영이는 도심 속의 삶에 싫증을 느꼈고, 친구 현수가 있는 시골로 농사를 지으려 내려왔다. 현수의 땅은 크기가 N×N 인 정사각형이고, 땅은 단위 정사각형 1×1로 나누어져 있다. 각 단위 정사각형 (i,j)의 수익은 Aij이다. Aij는 음수가 될 수도 있다. (땅을 경작하지 않아 관리가 필요한 경우)\n현수는 자신의 땅의 일부를 상근이와 선영이에게 빌려주려고 한다. 두 사람이 받게되는 땅은 항상 직사각형 모양이고, 변은 축에 평행하다.\n현수는 두 사람이 농사지을 땅의 수익의 합이 같게 되도록 땅을 빌려주려고 한다. 또, 경쟁심을 유도하기위해 두 땅은 꼭짓점 하나에서만 만나게 하려고 한다. (변을 공유할 수는 없다)\n현수 땅의 정보가 주어졌을 때, 땅을 나누어주는 방법의 수를 구하는 프로그램을 작성하시오. ",
        "input": "첫째 줄에 땅의 크기 N (1 ≤ N ≤ 50)이 주어진다.\n다음 N개의 줄의 N번째 숫자 Aij는 부분 정사각형 (i,j)의 수익이다. (-1000 < Aij < 1000)",
        "output": "현수의 조건을 만족시키면서 땅을 빌려주는 방법의 수를 출력한다.",
        "time_limit": 1.0,
        "memory_limit": 256,
        "level" : 1,
        "created_by": "host_id",
        "created_at": "2024-05-26",
        "modified_at": "2024-05-26",
        "tags": [124, 102],
        "time_compexity": null
    },

    {
        "id": 9,
        "url": "https://www.acmicpc.net/problem/17496",
        "title": "스타후르츠",
        "description": "진수는 회사 생활에 지쳐 회사를 그만두고 귀농을 하여 작물들을 키우며 생활하고 있습니다. 진수는 작물 중에서도 '스타후르츠' 라는 작물을 제일 좋아합니다.\n스타후르츠 씨앗을 심으면 자라는데 T일이 걸립니다. i일에 스타후르츠 씨앗을 심으면 i+T일에 수확할 수 있고 수확한 날에도 같은 칸에 씨앗을 또 심을 수 있습니다.\n진수에게는 스타후르츠 씨앗을 심을 수 있는 빈 칸이 C개 있고 한 칸에 한 개의 스타후르츠를 심을 수 있습니다.\n오늘은 여름 1일이고 N일까지 여름이 지속됩니다. 스타후르츠는 여름이 아닌 날에는 바로 시들어버리므로 N일이 지나면 더 이상 수확할 수 없습니다.\n진수는 스타후르츠 한 개를 판매하면 P원을 벌 수 있습니다. 진수는 올해 여름 동안 얼마나 많은 돈을 벌 수 있을까요?\n진수는 하루에 일을 원하는 만큼 할 수 있고, 씨앗도 충분히 가지고 있다고 가정합니다.",
        "input": "첫 번째 줄에 여름의 일 수 N (2 ≤ N ≤ 90) 과 스타후르츠가 자라는데 걸리는 일 수 T (1 ≤ T ≤ N-1) 와 스타후르츠를 심을 수 있는 칸의 수 C (1 ≤ C ≤ 300) 와 스타후르츠 개당 가격 정수 P (1 ≤ P ≤ 1,000) 가 주어집니다.",
        "output": "첫 번째 줄에 진수가 여름 동안 스타후르츠를 팔아 벌 수 있는 수익을 출력합니다.",
        "time_limit": 1.0,
        "memory_limit": 256,
        "level" : 1,
        "created_by": "host_id",
        "created_at": "2024-05-26",
        "modified_at": "2024-05-26",
        "tags": [124, 102],
        "time_compexity": null
    },

    {
        "id": 10,
        "url": "https://www.acmicpc.net/problem/2136",
        "title": "개미",
        "description": "길이가 L(2 ≤ L ≤ 1,000,000,000)인 막대기 위에 N(1 ≤ N ≤ 100,000)마리의 개미들이 서로 다른 위치에 살고 있다. 개미들은 크기가 매우 작기 때문에 이 문제에서는 개미가 크기가 없는 점이라고 생각하자. 각각의 개미의 위치는 x좌표로 표시되며, 좌표값은 0보다 크고 L보다 작은 값으로 표현된다.\n각각의 개미는 왼쪽, 혹은 오른쪽으로 움직이고 있다. 모든 개미들은 똑같은 속도로, 1초에 한 칸씩 움직인다. 개미들이 움직이는 도중에 서로 부딪히는 경우가 생길 수도 있다. 두 마리의 개미가 서로 부딪혔을 때, 두 마리의 개미는 모두 즉시 방향을 바꾸어 다시 움직이게 된다.\n개미들이 이동하다가 0인 위치나 L인 위치에 도달하게 되면, 그 개미는 막대기 아래로 떨어지게 된다. 개미들의 초기상태가 주어졌을 때, 가장 마지막에 떨어지는 개미와 그 개미가 떨어지는 시각을 알아내는 프로그램을 작성하시오.",
        "input": "첫째 줄에 두 정수 N, L이 주어진다. 다음 N개의 줄에는 각 개미의 초기 위치가 주어진다. 초기 위치가 양수로 주어지는 경우는 그 값이 그 개미의 위치가 되며, 그 개미는 오른쪽으로 움직이고 있다. 초기 위치가 음수로 주어지는 경우에는 그 절댓값이 그 개미의 위치가 되며, 그 개미는 왼쪽으로 움직이고 있다. 예를 들어 3이 주어지는 경우에는 3인 위치에서 오른쪽으로 움직이고 있고, -7인 경우에는 7인 위치에서 왼쪽으로 움직이고 있다.",
        "output": "첫째 줄에 두 정수 i, t를 출력한다. i는 가장 마지막에 떨어지는 개미의 번호이다. 개미의 번호는 입력에서 주어지는 순서대로 1, 2, …, N이다. t는 가장 마지막에 떨어지는 개미가 바닥에 떨어지는 시간이다. 가장 마지막에 떨어지는 개미가 여러 마리인 경우는 없다고 가정한다.",
        "time_limit": 2.0,
        "memory_limit": 128,
        "level" : 1,
        "created_by": "host_id",
        "created_at": "2024-05-26",
        "modified_at": "2024-05-26",
        "tags": [124, 102],
        "time_compexity": null
    }
]
